# print('Построчно вводите стих,' \
# 'отделяя строки нажатием Enter,' \
# 'чтобы посчитать количество слогов' \
# 'в строке. Последней строкой введите слово Конец')

# while True:
#     s = str(input())
#     if s == 'Конец' or s == 'конец':
#         break
#     k = 0                       # считает гласные в строке, для расчёта симетрии
#     for x in s:
#         if x in 'аеёиоуыэюя':
#             k = k + 1
#     print(k)
#     z = 0                       # считает знаки препинания, не для чего. просто домашнее задание
#     for y in s:
#         if y in '.,!?':
#             z = z +1
#     print(z)

